# Требуется вычислить, сколько раз встречается некоторое число k в массиве list_1.
# Найдите количество и выведите его.
# Пример:
list_1 = [1, 2, 3, 4, 5, 3]
k = 3
# # 1
print(list_1.count(k))
# count = 0
# for i in list_1:
#     if list_1[i]==k:
#         count+=1
# print(count)